Autodesk.Revit.DB.ScheduleDefinition.IsSchedulableField(Autodesk.Revit.DB.SchedulableField)
Checks whether a non-calculated/non-combined field is eligible to be included in
this schedule.
schedulableField:
The field to check.
Returns:
True if the field may be included in the schedule, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetSchedulableFields
Gets a list of all non-calculated/non-combined fields that are eligible to be
included in this schedule.
Returns:
A list of SchedulableField objects representing the non-calculated/non-combined
fields that may be included in the schedule.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByGlobalParameters(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a global parameter-based filter.
Remarks:
The global parameter-based filter types are IsAsociatedWith, IsNotAssociatedWith.
Only parameters which have a compatible type with at least one existing global parameter
can be filtered.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a global parameter-based filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.ScheduleDefinition.CanFilterBySubstring(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a substring-based filter.
Remarks:
The substring-based filter types are Contains, NotContains,
BeginsWith, NonBeginsWith, EndsWith and NotEndsWith.
Only string parameters can be filtered by substring.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a substring-based filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByValue(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a value-based filter.
Remarks:
The value-based filter types are Equal, NotEqual,
GreaterThan, GreaterThanOrEqual, LessThan and LessThanOrEqual.
Only certain types of parameters can be filtered by value.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a value based filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByParameterExistence(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a HasParameter filter.
Remarks:
The HasParameter filter type only supports shared parameters,
and only with the Instance or ElementType field types.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a HasParameter filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilter
Checks whether filters can be added to this ScheduleDefinition.
Remarks:
Key schedules and revision schedules do not support filters.
Returns:
True if this ScheduleDefinition supports filters, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFilters(System.Collections.Generic.IList{Autodesk.Revit.DB.ScheduleFilter})
Replaces all filters in this ScheduleDefinition.
filters:
The new list of filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resulting filter count would be greater than 8.
-or-
A field ID is not the ID of a field in this ScheduleDefinition.
-or-
A field and filter type cannot be used to filter this ScheduleDefinition.
-or-
A filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFilters
Gets all filters in this ScheduleDefinition.
Returns:
A list of all filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFilter(System.Int32,Autodesk.Revit.DB.ScheduleFilter)
Replaces a filter.
index:
The index of the filter to replace.
filter:
The new filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field and filter type cannot be used to filter this ScheduleDefinition.
-or-
The filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid filter index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFilter(System.Int32)
Gets a filter.
index:
The index of the filter.
Returns:
A copy of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid filter index.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.ClearFilters
Removes all filters.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.RemoveFilter(System.Int32)
Removes a filter.
index:
The index of the filter to remove.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid filter index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertFilter(Autodesk.Revit.DB.ScheduleFilter,System.Int32)
Adds a new filter at the specified position in the list.
filter:
The filter to add.
index:
The index in the list of filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field and filter type cannot be used to filter this ScheduleDefinition.
-or-
The filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
-or-
The resulting filter count would be greater than 8.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddFilter(Autodesk.Revit.DB.ScheduleFilter)
Adds a new filter at the end of the list.
filter:
The filter to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field and filter type cannot be used to filter this ScheduleDefinition.
-or-
The filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
-or-
The resulting filter count would be greater than 8.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFilterCount
Gets the number of filters in this ScheduleDefinition.
Returns:
The number of filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanSortByField(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used for sorting/grouping.
Remarks:
Schedules cannot be sorted/grouped by the Count field, Percentage
fields, or Formula fields that depend on Percentage fields because
those types of fields don't have meaningful values until after
sorting and grouping takes place.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used for sorting/grouping, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetSortGroupFields(System.Collections.Generic.IList{Autodesk.Revit.DB.ScheduleSortGroupField})
Replaces all sorting/grouping fields in this ScheduleDefinition.
sortGroupFields:
The new list of sorting/grouping fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resulting sorting/grouping field count would be greater than 4.
-or-
A field ID is not the ID of a field in this ScheduleDefinition.
-or-
A field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupFields
Gets all sorting/grouping fields in this ScheduleDefinition.
Returns:
A list of all sorting/grouping fields.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetSortGroupField(System.Int32,Autodesk.Revit.DB.ScheduleSortGroupField)
Replaces a sorting/grouping field.
index:
The index of the sorting/grouping field to replace.
sortGroupField:
The new sorting/grouping field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid sorting/grouping field index.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupField(System.Int32)
Gets a sorting/grouping field.
index:
The index of the sorting/grouping field.
Returns:
A copy of the sorting/grouping field.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid sorting/grouping field index.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.ClearSortGroupFields
Removes all sorting/grouping fields.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.RemoveSortGroupField(System.Int32)
Removes a sorting/grouping field.
index:
The index of the sorting/grouping field to remove.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid sorting/grouping field index.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertSortGroupField(Autodesk.Revit.DB.ScheduleSortGroupField,System.Int32)
Adds a new sorting/grouping field at the specified position in the list.
sortGroupField:
The sorting/grouping field to add.
index:
The index in the list of sorting/grouping fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The resulting sorting/grouping field count would be greater than 4.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddSortGroupField(Autodesk.Revit.DB.ScheduleSortGroupField)
Adds a new sorting/grouping field at the end of the list.
sortGroupField:
The sorting/grouping field to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The resulting sorting/grouping field count would be greater than 4.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupFieldCount
Gets the number of sorting/grouping fields in this ScheduleDefinition.
Returns:
The number of sorting/grouping fields.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidFieldId(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a ScheduleFieldId is the ID of a field in this ScheduleDefinition.
fieldId:
The field ID to check.
Returns:
True if the field ID is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidFieldIndex(System.Int32)
Checks whether an integer is a valid zero-based field index in this ScheduleDefinition.
index:
The field index to check.
Returns:
True if the field index is valid, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFieldIndex(Autodesk.Revit.DB.ScheduleFieldId)
Converts a field ID to the corresponding field index.
fieldId:
The field ID.
Returns:
The field index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFieldId(System.Int32)
Converts a field index to the corresponding field ID.
index:
The field index.
Returns:
The field ID.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid field index in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFieldOrder(System.Collections.Generic.IList{Autodesk.Revit.DB.ScheduleFieldId})
Reorders the fields in the schedule.
fieldIds:
The field IDs in a new order.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldIds does not contain exactly the same field IDs as this ScheduleDefinition currently contains.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFieldOrder
Gets the IDs of the current list of fields in order.
Returns:
The IDs of the current list of fields.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetField(Autodesk.Revit.DB.ScheduleFieldId)
Gets a field.
fieldId:
The ID of the field.
Returns:
The field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetField(System.Int32)
Gets a field.
index:
The index of the field.
Returns:
The field.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid field index in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.ClearFields
Removes all fields.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.RemoveField(Autodesk.Revit.DB.ScheduleFieldId)
Removes a field.
fieldId:
The ID of the field to remove.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.RemoveField(System.Int32)
Removes a field.
index:
The index of the field to remove.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid field index in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertCombinedParameterField(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData},System.String,System.Int32)
Adds a combined parameter field at the specified position in the list.
data:
The combined parameters array.
fieldName:
The field name.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Since:
2017

Autodesk.Revit.DB.ScheduleDefinition.IsValidCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Checks if data is valid for combined parameters
data:
data is array of TableCellCombinedParameterData to be set as combined parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.ScheduleDefinition.InsertField(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId,System.Int32)
Adds a regular field at the specified position in the list.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The field specified by fieldType and parameterId may not included in this ScheduleDefinition.
-or-
The field specified by fieldType and parameterId is already included in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertField(Autodesk.Revit.DB.ScheduleFieldType,System.Int32)
Adds a regular field at the specified position in the list.
fieldType:
The type of data displayed by the field.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by fieldType may not included in this ScheduleDefinition.
-or-
The field specified by fieldType is already included in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertField(Autodesk.Revit.DB.SchedulableField,System.Int32)
Adds a regular field at the specified position in the list.
schedulableField:
A SchedulableField object representing the field.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by schedulableField may not included in this ScheduleDefinition.
-or-
The field specified by schedulableField is already included in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddField(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId)
Adds a regular field at the end of the list.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The field specified by fieldType and parameterId may not included in this ScheduleDefinition.
-or-
The field specified by fieldType and parameterId is already included in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddField(Autodesk.Revit.DB.ScheduleFieldType)
Adds a regular field at the end of the list.
fieldType:
The type of data displayed by the field.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by fieldType may not included in this ScheduleDefinition.
-or-
The field specified by fieldType is already included in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddField(Autodesk.Revit.DB.SchedulableField)
Adds a regular field at the end of the list.
schedulableField:
A SchedulableField object representing the field.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by schedulableField may not included in this ScheduleDefinition.
-or-
The field specified by schedulableField is already included in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFieldCount
Gets the number of fields in this ScheduleDefinition.
Returns:
The number of fields.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetValidCategoriesForEmbeddedSchedule
Get all categories that can be used for an embedded ScheduleDefinition
in this ScheduleDefinition.
Returns:
The IDs of all valid categories.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidCategoryForEmbeddedSchedule(Autodesk.Revit.DB.ElementId)
Indicates if a category can be used for an embedded ScheduleDefinition
in this ScheduleDefinition.
categoryId:
The category ID to check.
Returns:
True if the category can be used for an embedded ScheduleDefinition,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanHaveEmbeddedSchedule
Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition
added.
Remarks:
Only schedules of the following categories can have an embedded
ScheduleDefinition:
Rooms
Spaces
Electrical Circuits
Duct Systems
Piping Systems
Key schedules cannot have embedded schedules.
Returns:
True if this ScheduleDefinition can have an embedded ScheduleDefinition,
false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.RemoveEmbeddedSchedule
Removes the embedded ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not have an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddEmbeddedSchedule(Autodesk.Revit.DB.ElementId)
Adds an embedded ScheduleDefinition.
categoryId:
The category ID of elements to display in the embedded schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId is not the ID of a category that can be used for an embedded
ScheduleDefinition in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition is not a kind of schedule that supports adding an embedded
ScheduleDefinition.
-or-
This ScheduleDefinition already has an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanIncludeLinkedFiles
Checks whether the schedule is a type that supports
including elements from linked files.
Remarks:
Elements from linked files can be included in schedules of normal
model elements and in sheet lists, but not in most other specialized
kinds of schedules.
Returns:
True if elements from linked files can be included, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ScheduleDefinition.ShowGridLines
Indicates if the schedule grid lines will be visible on a sheet.
Since:
2019.2

Autodesk.Revit.DB.ScheduleDefinition.ShowHeaders
Indicates if the headers will be displayed in the schedule.
Since:
2015 Subscription Update

Autodesk.Revit.DB.ScheduleDefinition.ShowTitle
Indicates if the title will be displayed in the schedule.
Since:
2015 Subscription Update

Autodesk.Revit.DB.ScheduleDefinition.GrandTotalTitle
The title name is used to display at the grand total row. The name is "Grand total", expressed in the Revit session language, by default.
Remarks:
GrandTotalTitle can only be set when both ShowGrandTotal and ShowGrandTotalTitle are enabled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Display of a grand total row is not enabled.
-or-
When setting this property: Display of grand total title is not enabled.
Since:
2015

Autodesk.Revit.DB.ScheduleDefinition.ShowGrandTotalCount
Indicates if the grand total row should display a count of elements
in the schedule.
Remarks:
ShowGrandTotalCount can only be enabled if ShowGrandTotal is enabled.
True if an element count should be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Display of a grand total row is not enabled.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.ShowGrandTotalTitle
Indicates if the grand total row should display a title.
Remarks:
The title consists of the text "Grand total".
ShowGrandTotalTitle can only be enabled if ShowGrandTotal
is enabled.
True if a title should be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Display of a grand total row is not enabled.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.ShowGrandTotal
Indicates if a grand total row should be displayed at the bottom of
the schedule.
Remarks:
The grand total row displays totals of each field for which
totals are enabled.  It can also optionally display a title
(see ShowGrandTotalTitle) and a count of elements
(see ShowGrandTotalCount).
True if a grand total row should be displayed, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsEmbedded
Indicates if this is an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.HasEmbeddedSchedule
Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.EmbeddedDefinition
The embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsItemized
Indicates if the schedule displays each element on a separate row or
combines multiple grouped elements onto the same row.
Remarks:
In an itemized schedule, each scheduled element is displayed on
a separate row.
In a non-itemized schedule, elements that are grouped together
according to the schedule's grouping criteria are combined onto a
single row.  For example, if a schedule is grouped by Level and Type,
elements having the same Level and Type will appear on the same row.
In non-itemized schedules, the Count field can be used to display
the number of elements on the row, and totaled fields will display
the sum of the values from all elements on the row.  If a field is
not totaled and the elements on the row have different values for
the field, an empty cell will be displayed.
True if the schedule displays each element on a separate row.  False
if multiple grouped elements are combined on the same row.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleDefinition is a key schedule.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IncludeLinkedFiles
Indicates if the schedule includes elements from linked files.
Remarks:
For an embedded ScheduleDefinition, this setting is controlled
by the primary ScheduleDefinition and cannot be set in the embedded
ScheduleDefinition.
True if elements in linked files should be included, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleDefinition does not support including elements from linked files.
-or-
When setting this property: This ScheduleDefinition is an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsMaterialTakeoff
Indicates if the schedule is a material takeoff.
Remarks:
A material takeoff is a schedule that displays information about
the materials that make up elements in the model.  Unlike regular
schedules where each row (before grouping) represents a single
element, each row in a material takeoff represents a single
<element, material> pair.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsKeySchedule
Indicates if the schedule is a key schedule.
Remarks:
A key schedule displays abstract "key" elements that can be used to
populate parameters of ordinary model elements.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.FamilyId
In a note block schedule, the ID of the Generic Annotation family
displayed by the schedule.
Remarks:
A note block is a schedule of the Generic Annotations category
that shows elements of a single family rather than all elements
in the category.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AreaSchemeId
In an area schedule, the ID of the area scheme to display.
Remarks:
Schedules of the Areas category show area elements belonging to a single
area scheme.
Key schedules of the Areas category apply to all area schemes, so they
don't have an area scheme ID.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CategoryId
The category ID of elements appearing in the schedule.
Remarks:
Most schedules show elements of a single category.  In multi-category
schedules, the category ID is InvalidElementId.  In key schedules,
the schedule's category is the category of elements that the keys are
associated with.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition
Settings that define the contents of a schedule.
Remarks:
The ScheduleDefinition class contains various settings that
define the contents of a schedule view, including:
The schedule's category and other basic properties that determine the type of schedule.
A set of fields that become the columns of the schedule.
Filters that restrict the set of elements visible in the schedule.
Sorting and grouping criteria.
Most schedules contain a single ScheduleDefinition.  In Revit MEP,
schedules of certain categories can contain an "embedded schedule" containing
elements associated with the elements in the primary schedule, for example a
room schedule showing the elements inside each room or a duct system schedule
showing the elements associated with each system.  An embedded schedule has
its own category, fields, filters, etc.  Those settings are stored in a
second ScheduleDefinition object.
Since:
2013